erpedt.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c10085b0-8e5e-4fae-894b-5098ccc2ad7c">
      <name>ПроконтролироватьКачество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5665e096-98e9-4c26-9342-25c72b7b133b">
      <name>ДатаПодтвержденияКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят И
			ТипЗнч(ЭтотОбъект.Распоряжение) = ТИП("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ДокРаспоряжения = ЭтотОбъект.Распоряжение.ПолучитьОбъект(); 
			ДокРаспоряжения.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
			ДокРаспоряжения.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;			
КонецПроцедуры


&После("ЗаполнитьТоварыПоТоварамКПоступлению")
Процедура Расш1_ЗаполнитьТоварыПоТоварамКПоступлению(ВидЗаполнения, ДатаПоступления)
	Если ТипЗнч(ЭтотОбъект.Распоряжение) = ТИП("ДокументСсылка.ЗаказНаСборку") И Товары.Количество() = 1 Тогда
		Попытка
			Товары[0].Серия = ЭтотОбъект.Распоряжение.СХК_СерииНоменклатуры	;
			Товары[0].СтатусУказанияСерий = 4;  
			Товары[0].КоличествоУпаковок = ЭтотОбъект.Распоряжение.КоличествоУпаковок;  
			Товары[0].Упаковка = ЭтотОбъект.Распоряжение.Упаковка;
			Товары[0].Количество =  ЭтотОбъект.Распоряжение.Упаковка.Числитель * ЭтотОбъект.Распоряжение.КоличествоУпаковок;
		Исключение
			Сообщить("Не удалось вставить серию: " +Строка(ЭтотОбъект.Распоряжение.СХК_СерииНоменклатуры));
		КонецПопытки;
	КонецЕслИ;
КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура Расш1_ОбработкаУдаленияПроведения(Отказ)  
	
	ДокументПоступления =  СХК_ТСДСклад.ПроверкаДокументаПоступления( ЭтотОбъект.Ссылка);
	Если Не РольДоступна("ПолныеПрава") Тогда	
		Если ДокументПоступления <> Ложь Тогда
			Сообщить("Документ принят на склад " + Строка(ДокументПоступления));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
